CSI API ETABS v1

# cPropFrameGetAngle_1 Method

---

Retrieves frame section property data for an angle-type frame section.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetAngle_1(
    	string Name,
    	ref string FileName,
    	ref string MatProp,
    	ref double T3,
    	ref double T2,
    	ref double Tf,
    	ref double Tw,
    	ref double FilletRadius,
    	ref int Color,
    	ref string Notes,
    	ref string GUID
    )

    Function GetAngle_1 (
    	Name As String,
    	ByRef FileName As String,
    	ByRef MatProp As String,
    	ByRef T3 As Double,
    	ByRef T2 As Double,
    	ByRef Tf As Double,
    	ByRef Tw As Double,
    	ByRef FilletRadius As Double,
    	ByRef Color As Integer,
    	ByRef Notes As String,
    	ByRef GUID As String
    ) As Integer

    Dim instance As cPropFrame
    Dim Name As String
    Dim FileName As String
    Dim MatProp As String
    Dim T3 As Double
    Dim T2 As Double
    Dim Tf As Double
    Dim Tw As Double
    Dim FilletRadius As Double
    Dim Color As Integer
    Dim Notes As String
    Dim GUID As String
    Dim returnValue As Integer

    returnValue = instance.GetAngle_1(Name,
    	FileName, MatProp, T3, T2, Tf, Tw, FilletRadius,
    	Color, Notes, GUID)

    int GetAngle_1(
    	String^ Name,
    	String^% FileName,
    	String^% MatProp,
    	double% T3,
    	double% T2,
    	double% Tf,
    	double% Tw,
    	double% FilletRadius,
    	int% Color,
    	String^% Notes,
    	String^% GUID
    )

    abstract GetAngle_1 :
            Name : string *
            FileName : string byref *
            MatProp : string byref *
            T3 : float byref *
            T2 : float byref *
            Tf : float byref *
            Tw : float byref *
            FilletRadius : float byref *
            Color : int byref *
            Notes : string byref *
            GUID : string byref -> int

#### Parameters

Name

    Type: SystemString
The name of an existing frame section property.

FileName

    Type: SystemString
If the section property was imported from a property file, this is the name of
that file. If the section property was not imported, this item is blank.

MatProp

    Type: SystemString
The name of the material property for the section.

T3

    Type: SystemDouble

T2

    Type: SystemDouble

Tf

    Type: SystemDouble

Tw

    Type: SystemDouble

FilletRadius

    Type: SystemDouble
The fillet radius. [L]

Color

    Type: SystemInt32

Notes

    Type: SystemString

GUID

    Type: SystemString
The GUID (global unique identifier), if any, assigned to the section.

#### Return Value

Type: Int32
returns zero if the section property data is successfully retrieved; otherwise
it returns a nonzero value.

Remarks

This function is obsolete and has been superseded by GetSteelAngle(String,
String, String, Double, Double, Double, Double, Double, Boolean, Boolean,
Int32, String, String) and
[GetConcreteL(String, String, String, Double, Double, Double, Double, Double,
Boolean, Boolean, Int32, String, String)](5cd128fe-
bb50-58b4-c365-4d011d596fe0.htm) as of version 16.0.0. This function is
maintained for backwards compatibility.

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1
           Dim FileName As String
           Dim MatProp As String
           Dim t3 As Double
           Dim t2 As Double
           Dim tf As Double
           Dim tw As Double
           Dim FilletRadius As Double
           Dim Color As Integer
           Dim Notes As String
           Dim GUID As String

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

       'set new frame section property
           ret = SapModel.PropFrame.SetAngle_1("ANGLE1", "A992Fy50", 6, 4, 0.5, 0.5, 0.25)

       'get frame section property data
           ret = SapModel.PropFrame.GetAngle_1("ANGLE1", FileName, MatProp, t3, t2, tf, tw, FilletRadius, Color, Notes, GUID)

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cPropFrame Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com